IDENTIFICATION DIVISION.                                
PROGRAM-ID. MY_UTF.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 U1                  PIC U DYNAMIC LENGTH LIMIT 10.          *> DYNAMIC-LENGTH UTF-8 DATA ITEM
01 U2                  PIC U(10) USAGE UTF-8.                  *> FIXED CHARACTER-LENGTH ITEM, USAGE UTF-8 SPECIFIED EXPLICITLY
77 U3                  PIC UUU USAGE UTF-8.                    *> FIXED CHARACTER-LENGTH ITEM
77 U4                  PIC U DYNAMIC LENGTH USAGE UTF-8.       *> DYNAMIC LENGTH ITEM  
